app/controllers/comments_controller.rb

INSERT INTO "comments" ("author", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "Bubba"], ["body", "Nifty comments there!"], ["post_id", 1], ["created_at", "2015-11-06 03:57:54.501083"], ["updated_at", "2015-11-06 03:57:54.501083"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.post_id = params[:post_id]
    @comment.save