app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.save
---
INSERT INTO "posts" ("caption", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["caption", "\"Testing the create method\""], ["created_at", "2015-11-06 01:23:22.248912"], ["updated_at", "2015-11-06 01:23:22.248912"]]

  def update
    @post = Post.find(params[:id])
    @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "posts" SET "image_updated_at" = $1, "image_file_name" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["image_updated_at", "2015-11-08 05:19:03.268502"], ["image_file_name", "cat_icon.png"], ["updated_at", "2015-11-08 05:19:03.944091"], ["id", 1]]